10/data/attachments/f53c5a34ccabe1d9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_d7692a9d-d0ce-457b-9faf-562185c50258</nif:username>
            <nif:friendToBeAdded>Christopher_record_Actions_74172_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>